tests/k6/results-baseurl-030826.txt
[.../IntegradorII/Project/integrador2][testing][un 󰋗 1]
❮NORMAL❯ k6 run tests/k6/api_load_test.js                                          

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: tests/k6/api_load_test.js
        output: -

     scenarios: (100.00%) 1 scenario, 50 max VUs, 1m10s max duration (incl. graceful stop):
              * default: Up to 50 looping VUs for 40s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)



  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<500' p(95)=164.93ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 1962    47.876142/s
    checks_succeeded...: 100.00% 1962 out of 1962
    checks_failed......: 0.00%   0 out of 1962

    ✓ status is 200
    ✓ api status success

    HTTP
    http_req_duration..............: avg=85.44ms min=33.1ms med=80.69ms max=227.57ms p(90)=118.54ms p(95)=164.93ms
      { expected_response:true }...: avg=85.44ms min=33.1ms med=80.69ms max=227.57ms p(90)=118.54ms p(95)=164.93ms
    http_req_failed................: 0.00%  0 out of 981
    http_reqs......................: 981    23.938071/s

    EXECUTION
    iteration_duration.............: avg=1.09s   min=1.03s  med=1.08s   max=1.39s    p(90)=1.15s    p(95)=1.17s   
    iterations.....................: 981    23.938071/s
    vus............................: 2      min=2        max=49
    vus_max........................: 50     min=50       max=50

    NETWORK
    data_received..................: 666 kB 16 kB/s
    data_sent......................: 123 kB 3.0 kB/s



running (0m41.0s), 00/50 VUs, 981 complete and 0 interrupted iterations
default ✓ [======================================] 00/50 VUs  40s